In [36]:
import numpy as np ; import pandas as pd

The dataset is designed for practice. It is not a real dataset.

In [37]:
dataset = {'Names':['Okan','Furkan','Ahmet','Meriç','Çağrı','Berk','Ulaş','Haydar','Necati','Efecan'],
           'Lessons':['Math' for i in range(10)],
          'Notes1':[75,83,96,73,90,63,52,120,np.nan,90],
           'Notes2':[82,99,94,44,77,34,22,47,77,75],
          'sport': ['Football','Basketball','Tennis','Football','Swimming','Tennis','Rider','Football','Swimming','Hokey']}

We will look for missing and outlier data in the data set. If there are we will clean them up and then analyze the dataset.

In [38]:
df = pd.DataFrame(dataset)

In [39]:
df

    Names Lessons  Notes1  Notes2       sport
0    Okan    Math    75.0      82    Football
1  Furkan    Math    83.0      99  Basketball
2   Ahmet    Math    96.0      94      Tennis
3   Meriç    Math    73.0      44    Football
4   Çağrı    Math    90.0      77    Swimming
5    Berk    Math    63.0      34      Tennis
6    Ulaş    Math    52.0      22       Rider
7  Haydar    Math   120.0      47    Football
8  Necati    Math     NaN      77    Swimming
9  Efecan    Math    90.0      75       Hokey

In [40]:
df.shape

(10, 5)

There are 10 columns and 5 rows in dataset.

In [41]:
df.columns

Index(['Names', 'Lessons', 'Notes1', 'Notes2', 'sport'], dtype='object')

In [42]:
df.describe().T

        count       mean        std   min    25%   50%    75%    max
Notes1    9.0  82.444444  19.869016  52.0  73.00  83.0  90.00  120.0
Notes2   10.0  65.100000  26.349995  22.0  44.75  76.0  80.75   99.0

In [43]:
df.head()

    Names Lessons  Notes1  Notes2       sport
0    Okan    Math    75.0      82    Football
1  Furkan    Math    83.0      99  Basketball
2   Ahmet    Math    96.0      94      Tennis
3   Meriç    Math    73.0      44    Football
4   Çağrı    Math    90.0      77    Swimming

In [44]:
df.tail()

    Names Lessons  Notes1  Notes2     sport
5    Berk    Math    63.0      34    Tennis
6    Ulaş    Math    52.0      22     Rider
7  Haydar    Math   120.0      47  Football
8  Necati    Math     NaN      77  Swimming
9  Efecan    Math    90.0      75     Hokey

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Names    10 non-null     object
 1   Lessons  10 non-null     object
 2   Notes1   9 non-null      float64
 3   Notes2   10 non-null     int64
 4   sport    10 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 528.0+ bytes

Dataset has 5 columns(1 int, 1 float, 3 object data types). There is one null values in Notes1 column. We will change for more analize some column names. From sport to Sports.

In [46]:
df = df.rename(columns={'sport':'Sports'})

In [47]:
df.isnull().sum()

Names      0
Lessons    0
Notes1     1
Notes2     0
Sports     0
dtype: int64

We will clean the missing value.

In [48]:
df = df.dropna()

In [49]:
df['Notes1'].value_counts().sort_index()

52.0     1
63.0     1
73.0     1
75.0     1
83.0     1
90.0     2
96.0     1
120.0    1
Name: Notes1, dtype: int64

All unique value but most of the note should 100.0 value. 120.0 is outlier value. We will clean it the dataset.

In [50]:
df['Notes1'] = df['Notes1'].astype(int)

In [51]:
df

    Names Lessons  Notes1  Notes2      Sports
0    Okan    Math      75      82    Football
1  Furkan    Math      83      99  Basketball
2   Ahmet    Math      96      94      Tennis
3   Meriç    Math      73      44    Football
4   Çağrı    Math      90      77    Swimming
5    Berk    Math      63      34      Tennis
6    Ulaş    Math      52      22       Rider
7  Haydar    Math     120      47    Football
9  Efecan    Math      90      75       Hokey

In [52]:
df = df[(df['Notes1'] <= 100) & (df['Notes1'] >= 0)]

In [53]:
df

    Names Lessons  Notes1  Notes2      Sports
0    Okan    Math      75      82    Football
1  Furkan    Math      83      99  Basketball
2   Ahmet    Math      96      94      Tennis
3   Meriç    Math      73      44    Football
4   Çağrı    Math      90      77    Swimming
5    Berk    Math      63      34      Tennis
6    Ulaş    Math      52      22       Rider
9  Efecan    Math      90      75       Hokey

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Names    8 non-null      object
 1   Lessons  8 non-null      object
 2   Notes1   8 non-null      int32
 3   Notes2   8 non-null      int64
 4   Sports   8 non-null      object
dtypes: int32(1), int64(1), object(3)
memory usage: 352.0+ bytes

In [55]:
average= (df['Notes1'] + df['Notes2']) / 2

In [56]:
average

0    78.5
1    91.0
2    95.0
3    58.5
4    83.5
5    48.5
6    37.0
9    82.5
dtype: float64

In [57]:
type(average)

pandas.core.series.Series

In [58]:
df['average_columns'] = average

<ipython-input-58-afdeb9214196>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['average_columns'] = average

In [59]:
df

    Names Lessons  Notes1  Notes2      Sports  average_columns
0    Okan    Math      75      82    Football             78.5
1  Furkan    Math      83      99  Basketball             91.0
2   Ahmet    Math      96      94      Tennis             95.0
3   Meriç    Math      73      44    Football             58.5
4   Çağrı    Math      90      77    Swimming             83.5
5    Berk    Math      63      34      Tennis             48.5
6    Ulaş    Math      52      22       Rider             37.0
9  Efecan    Math      90      75       Hokey             82.5

In [60]:
df.rename(columns={'average_columns':'average_notes'},inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:4441: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

In [61]:
df

    Names Lessons  Notes1  Notes2      Sports  average_notes
0    Okan    Math      75      82    Football           78.5
1  Furkan    Math      83      99  Basketball           91.0
2   Ahmet    Math      96      94      Tennis           95.0
3   Meriç    Math      73      44    Football           58.5
4   Çağrı    Math      90      77    Swimming           83.5
5    Berk    Math      63      34      Tennis           48.5
6    Ulaş    Math      52      22       Rider           37.0
9  Efecan    Math      90      75       Hokey           82.5

In [62]:
def cal_mean(sport):
    means = df[df['Sports'] == sport]['average_notes'].mean()
    return sport + ' players is mean math notes:',means

In [63]:
cal_mean('Basketball')

('Basketball players is mean math notes:', 91.0)

In [64]:
cal_mean('Football')

('Football players is mean math notes:', 68.5)

In [65]:
cal_mean('Tennis')

('Tennis players is mean math notes:', 71.75)

In [66]:
cal_mean('Swimming')

('Swimming players is mean math notes:', 83.5)

In [67]:
cal_mean('Rider')

('Rider players is mean math notes:', 37.0)

In [68]:
cal_mean('Hokey')

('Hokey players is mean math notes:', 82.5)

In [69]:
df['Sports'].value_counts().sort_index()

Basketball    1
Football      2
Hokey         1
Rider         1
Swimming      1
Tennis        2
Name: Sports, dtype: int64

In [70]:
df[df['Sports'] == 'Football']

   Names Lessons  Notes1  Notes2    Sports  average_notes
0   Okan    Math      75      82  Football           78.5
3  Meriç    Math      73      44  Football           58.5

In [71]:
df[df['Sports'] == 'Tennis']

   Names Lessons  Notes1  Notes2  Sports  average_notes
2  Ahmet    Math      96      94  Tennis           95.0
5   Berk    Math      63      34  Tennis           48.5

When we examine the data set, we see that the student who plays tennis has the highest grade, but the situation is different on average. Because there are 2 students playing tennis and the other one got low grades. Since he is a student playing basketball, the student with the highest grade on average comes out. The number of students has an effect on the average.